# UsesDST Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SunAndShadowSettings..::..UsesDST Property
SunAndShadowSettings Class See Also
---
Identifies whether the SunAndShadowSettings element is using daylight savings time.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool UsesDST { get; }
```

Visual Basic
---
```text
Public ReadOnly Property UsesDST As Boolean
	Get
```

Visual C++
---
```text
public:
property bool UsesDST {
	bool get ();
}
```

# See Also
SunAndShadowSettings Class
Autodesk.Revit.DB Namespace